"""Определитель того, как можно расфасовать определённое количество пирожных."""


def print_pack_report(n):
    """Печатает, по сколько штук пирожных можно расфасовать по коробкам.

    Args:
        n: количество пирожных.
    """
    for i in range(n, 0, -1):
        if i % 5 == 0 and i % 3 == 0:
            print(f"{i} - расфасуем по 3 или по 5")
        elif i % 5 == 0 and i % 3 != 0:
            print(f"{i} - расфасуем по 5")
        elif i % 5 != 0 and i % 3 == 0:
            print(f"{i} - расфасуем по 3")
        else:
            print(f"{i} - не заказываем!")


if __name__ == "__main__":
    print_pack_report(15)